In [1]:
import warnings
warnings.filterwarnings('ignore')

# Import Relevant Packages
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

# Gross enrolment

In [33]:
enrol = pd.read_csv('Enrol.csv')
enrol.drop("Unnamed: 0", axis = "columns", inplace=True)
enrol.head()

,State_UT,Year,Primary_Boys,Primary_Girls,Primary_Total,Upper_Primary_Boys,Upper_Primary_Girls,Upper_Primary_Total,Secondary_Boys,Secondary_Girls,Secondary_Total,Higher_Secondary_Boys,Higher_Secondary_Girls,Higher_Secondary_Total
0,Andaman & Nicobar Islands,2013-14,95.88,91.97,93.93,94.70,88.98,91.83,102.89,97.36,100.16,105.40,96.61,101.28
1,Andhra Pradesh,2013-14,96.62,96.87,96.74,82.81,84.38,83.57,73.76,76.77,75.20,59.83,60.83,60.30
2,Arunachal Pradesh,2013-14,129.12,127.77,128.46,112.64,115.27,113.94,88.37,84.89,86.65,65.16,65.38,65.27
3,Assam,2013-14,111.77,115.16,113.43,87.85,98.69,93.13,65.60,77.20,71.21,31.78,34.27,32.94
4,Bihar,2013-14,95.03,101.15,97.96,80.60,94.92,87.24,57.66,62.96,60.08,23.33,24.17,23.70

In [34]:
#exploring for just all indian

enrol = enrol[enrol["State_UT"]=="All India"].reset_index(drop=True)

### Boys enrol

In [35]:
#dataframe of just the result from boy

enrolboy = enrol.drop(columns=[ 'Primary_Girls', 'Primary_Total',
       'Upper_Primary_Girls', 'Upper_Primary_Total',
       'Secondary_Girls', 'Secondary_Total',
       'Higher_Secondary_Girls', 'Higher_Secondary_Total'])

In [36]:
#adding the columns

enrolboy.columns = enrolboy.columns.map(lambda x : x + "_enrol" if x != "State_UT" and x != 'year' else x)

In [37]:
enrolboy.head()

,State_UT,Year_enrol,Primary_Boys_enrol,Upper_Primary_Boys_enrol,Secondary_Boys_enrol,Higher_Secondary_Boys_enrol
0,All India,2013-14,100.20,86.31,76.80,52.77
1,All India,2015-16,97.87,88.72,79.16,55.95
2,All India,2014-15,98.85,87.71,78.13,54.57

### Girl Dropout

In [38]:
#dataframe of just the result from girls

enrolgirl = enrol.drop(columns=['Primary_Boys', 'Primary_Total',
       'Upper_Primary_Boys','Upper_Primary_Total',
       'Secondary_Boys', 'Secondary_Total',
       'Higher_Secondary_Boys','Higher_Secondary_Total'])

In [39]:
#adding the columns

enrolgirl.columns = enrolgirl.columns.map(lambda x : x + "_enrol" if x != "State_UT" and x != 'year' else x)

In [40]:
enrolgirl.head()

,State_UT,Year_enrol,Primary_Girls_enrol,Upper_Primary_Girls_enrol,Secondary_Girls_enrol,Higher_Secondary_Girls_enrol
0,All India,2013-14,102.65,92.75,76.47,51.58
1,All India,2015-16,100.69,97.57,80.97,56.41
2,All India,2014-15,101.43,95.29,78.94,53.81

# Percentage of Schools with Electricity

In [41]:
elect = pd.read_csv('percentage-of-schools-with-electricity-2013-2016.csv')

#exploring for just all indian
elect = elect.loc[elect["State_UT"]=="All India"].reset_index(drop=True)

In [42]:
#dataframe of just the result from total

elect = elect.drop(columns=['Primary_with_U_Primary', 'Primary_with_U_Primary_Sec_HrSec', 
       'U_Primary_With_Sec_HrSec', 'Primary_with_U_Primary_Sec','U_Primary_With_Sec',  'Sec_with_HrSec.', 'All Schools'])

In [43]:
elect.columns=[str(col) + "_elect" for col in elect.columns]
elect.head()

,State_UT_elect,year_elect,Primary_Only_elect,U_Primary_Only_elect,Sec_Only_elect,HrSec_Only_elect
0,All India,2013-14,46.38,45.97,75.08,91.01
1,All India,2014-15,49.63,48.33,77.55,92.67
2,All India,2015-16,52.40,49.86,81.50,92.86

In [44]:
#joining it to the entrollment boy df

Totalboy = enrolboy.join(elect.iloc[:,-4:])

In [45]:
#joining it to the entrollment girl df

Totalgirl = enrolgirl.join(elect.iloc[:,-4:])

# Percentage of Schools with Computers

In [46]:
comps = pd.read_csv('percentage-of-schools-with-comps-2013-2016.csv', index_col=None)

#exploring for just all indian
comps = comps.loc[comps["State_UT"]=="All India"].reset_index(drop=True)

#dataframe of just the result from total
comps = comps.drop(columns=['Primary_with_U_Primary', 'Primary_with_U_Primary_Sec_HrSec', 
       'U_Primary_With_Sec_HrSec', 'Primary_with_U_Primary_Sec','U_Primary_With_Sec',  'Sec_with_HrSec.', 'All Schools'])

In [47]:
comps.columns=[str(col) + "_comps" for col in comps.columns]
comps.head()

,State_UT_comps,year_comps,Primary_Only_comps,U_Primary_Only_comps,Sec_Only_comps,HrSec_Only_comps
0,All India,2013-14,9.25,18.22,44.80,26.65
1,All India,2014-15,10.32,19.40,51.27,47.96
2,All India,2015-16,10.36,19.78,53.05,55.72

In [48]:
#Adding it to my Total boy and girl df

Totalboy = Totalboy.join(comps.iloc[:,-4:])

Totalgirl = Totalgirl.join(comps.iloc[:,-4:])

# Schools with Toilets

### Boy toilet

In [49]:
boystoilet = pd.read_csv('schools-with-boys-toilet-2013-2016.csv')

#exploring for just all indian
boystoilet = boystoilet.loc[boystoilet["State_UT"]=="All India"].reset_index(drop=True)

#dataframe of just the result from total
boystoilet = boystoilet.drop(columns=['Primary_with_U_Primary', 'Primary_with_U_Primary_Sec_HrSec', 
       'U_Primary_With_Sec_HrSec', 'Primary_with_U_Primary_Sec','U_Primary_With_Sec',  'Sec_with_HrSec.', 'All Schools'])

In [50]:
boystoilet.columns=[str(col) + "_boystoilet" for col in boystoilet.columns]
boystoilet.head()

,State_UT_boystoilet,year_boystoilet,Primary_Only_boystoilet,U_Primary_Only_boystoilet,Sec_Only_boystoilet,HrSec_Only_boystoilet
0,All India,2013-14,84.01,88.14,97.97,74.36
1,All India,2014-15,85.66,88.12,89.10,88.97
2,All India,2015-16,96.45,96.00,94.56,95.67

In [51]:
#Adding it to my Total df which would have all the dataset in one df 

Totalboy = Totalboy.join(boystoilet.iloc[:,-4:])

### Girl Toilet

In [52]:
girlstoilet = pd.read_csv('schools-with-girls-toilet-2013-2016.csv')

#exploring for just all indian
girlstoilet = girlstoilet.loc[girlstoilet["State_UT"]=="All India"].reset_index(drop=True)

#dataframe of just the result from total
girlstoilet = girlstoilet.drop(columns=['Primary_with_U_Primary', 'Primary_with_U_Primary_Sec_HrSec', 
       'U_Primary_With_Sec_HrSec', 'Primary_with_U_Primary_Sec','U_Primary_With_Sec',  'Sec_with_HrSec.', 'All Schools'])

In [53]:
girlstoilet.columns=[str(col) + "_girlstoilet" for col in girlstoilet.columns]
girlstoilet.head()

,State_UT_girlstoilet,year_girlstoilet,Primary_Only_girlstoilet,U_Primary_Only_girlstoilet,Sec_Only_girlstoilet,HrSec_Only_girlstoilet
0,All India,2013-14,88.68,91.39,99.06,76.14
1,All India,2014-15,91.21,91.39,90.26,90.94
2,All India,2015-16,96.95,96.32,95.18,96.22

In [54]:
#Adding it to my Total df which would have all the dataset in one df 

Totalgirl = Totalgirl.join(girlstoilet.iloc[:,-4:])

# Percentage of Schools with Drinking Water Facility

In [55]:
water = pd.read_csv('percentage-of-schools-with-water-facility-2013-2016.csv')

#exploring for just all indian
water = water.loc[water["State/UT"]=="All India"].reset_index(drop=True)

In [56]:
#dataframe of just the result from total

water = water.drop(columns=['Primary_with_U_Primary',
       'Primary_with_U_Primary_Sec_HrSec', 
       'U_Primary_With_Sec_HrSec', 'Primary_with_U_Primary_Sec',
       'U_Primary_With_Sec', 'Sec_with_HrSec.', 'All Schools'])
    
water.head()

    State/UT     Year  Primary_Only  U_Primary_Only  Sec_Only  HrSec_Only
0  All India  2013-14         94.09           93.90     96.52       97.14
1  All India  2014-15         94.88           94.82     96.32       98.23
2  All India  2015-16         95.78           95.65     97.05       97.92

In [57]:
water.columns=[str(col) + "_water" for col in water.columns]
water.head()

,State/UT_water,Year_water,Primary_Only_water,U_Primary_Only_water,Sec_Only_water,HrSec_Only_water
0,All India,2013-14,94.09,93.90,96.52,97.14
1,All India,2014-15,94.88,94.82,96.32,98.23
2,All India,2015-16,95.78,95.65,97.05,97.92

In [58]:
#Adding it to my Total df which would have all the dataset in one df 

Totalboy = Totalboy.join(water.iloc[:,-4:])
Totalgirl = Totalgirl.join(water.iloc[:,-4:])

# Total: comprises of all the data in one by Gender

In [78]:
Totalboy.shape

(3, 22)

In [79]:
Totalgirl.shape

(3, 22)

## is there any way we can increase the enrollment ratio ?

### Boys Enrollmemt facts via school level

In [61]:
all_cols = Totalboy.columns.to_list()
all_cols[2:]

['Primary_Boys_enrol',
 'Upper_Primary_Boys_enrol',
 'Secondary_Boys_enrol',
 'Higher_Secondary_Boys_enrol',
 'Primary_Only_elect',
 'U_Primary_Only_elect',
 'Sec_Only_elect',
 'HrSec_Only_elect',
 'Primary_Only_comps',
 'U_Primary_Only_comps',
 'Sec_Only_comps',
 'HrSec_Only_comps',
 'Primary_Only_boystoilet',
 'U_Primary_Only_boystoilet',
 'Sec_Only_boystoilet',
 'HrSec_Only_boystoilet',
 'Primary_Only_water',
 'U_Primary_Only_water',
 'Sec_Only_water',
 'HrSec_Only_water']

In [62]:
#Primary School Enrollment is affected by

Primaryboytotal = Totalboy.drop(columns=['Upper_Primary_Boys_enrol', 'Secondary_Boys_enrol', 'Higher_Secondary_Boys_enrol',
 'U_Primary_Only_elect', 'Sec_Only_elect', 'HrSec_Only_elect', 'U_Primary_Only_comps', 'Sec_Only_comps',
 'HrSec_Only_comps', 'U_Primary_Only_boystoilet', 'Sec_Only_boystoilet', 'HrSec_Only_boystoilet', 'U_Primary_Only_water',
 'Sec_Only_water', 'HrSec_Only_water'])

primaryboyenrol = Primaryboytotal.corrwith(Totalboy.Primary_Boys_enrol)

primaryboyenrol = pd.DataFrame(primaryboyenrol, columns=['Correlation'])
primaryboyenrol.dropna(inplace=True)
primaryboyenrol = primaryboyenrol[primaryboyenrol["Correlation"]>0.5].sort_values("Correlation",ascending=False)
primaryboyenrol[1:]

Empty DataFrame
Columns: [Correlation]
Index: []

None of our facilites impacts enrollment in Boys primary school

In [73]:
#Upper Primary School Dropout is affected by 

Uprimaryboytotal = Totalboy.drop(columns=[ 'Primary_Boys_enrol','Secondary_Boys_enrol', 'Higher_Secondary_Boys_enrol',
 'Primary_Only_elect', 'Sec_Only_elect', 'HrSec_Only_elect',
 'Primary_Only_comps', 'Sec_Only_comps', 'HrSec_Only_comps',
 'U_Primary_Only_boystoilet','Sec_Only_boystoilet', 'HrSec_Only_boystoilet',
 'U_Primary_Only_water', 'Sec_Only_water', 'HrSec_Only_water'])


uprimaryboyenrol = Uprimaryboytotal.corrwith(Totalboy.Upper_Primary_Boys_enrol)

uprimaryboyenrol = pd.DataFrame(uprimaryboyenrol, columns=['Correlation'])
uprimaryboyenrol.dropna(inplace=True)
uprimaryboyenrol = uprimaryboyenrol[uprimaryboyenrol["Correlation"]> 0.5].sort_values("Correlation",ascending=False)
uprimaryboyenrol[1:]

                      Correlation
U_Primary_Only_comps     0.786186
U_Primary_Only_elect     0.673792
Primary_Only_water       0.547352

Increase in computer faclites, electricity and water would have a positive impact on enrollment in Boys Upper primary

In [74]:
#Secondary School Dropout is affected by 

Secondaryboytotal = Totalboy.drop(columns=[ 'Primary_Boys_enrol', 'Upper_Primary_Boys_enrol', 'Higher_Secondary_Boys_enrol',
 'Primary_Only_elect', 'U_Primary_Only_elect', 'HrSec_Only_elect',
 'Primary_Only_comps', 'U_Primary_Only_comps', 'HrSec_Only_comps',
 'Primary_Only_boystoilet', 'U_Primary_Only_boystoilet', 'HrSec_Only_boystoilet',
 'Primary_Only_water', 'U_Primary_Only_water', 'HrSec_Only_water'])


Secondaryboyenrol = Secondaryboytotal.corrwith(Totalboy.Secondary_Boys_enrol)

Secondaryboyenrol = pd.DataFrame(Secondaryboyenrol, columns=['Correlation'])
Secondaryboyenrol.dropna(inplace=True)
Secondaryboyenrol = Secondaryboyenrol[Secondaryboyenrol["Correlation"]>0.5].sort_values("Correlation",ascending=False)
Secondaryboyenrol[1:]

                Correlation
Sec_Only_comps      0.79195

Computer facilites plays a role in the enrollment of the Boys secondary school

In [75]:
# Higher-Secondary School Dropout is affected by 

Hrsecondaryboytotal = Totalboy.drop(columns=['Primary_Boys_enrol', 'Upper_Primary_Boys_enrol','Secondary_Boys_enrol',
  'Primary_Only_elect','U_Primary_Only_elect', 'Sec_Only_elect',
  'Primary_Only_comps', 'U_Primary_Only_comps', 'Sec_Only_comps',
  'Primary_Only_boystoilet', 'U_Primary_Only_boystoilet', 'Sec_Only_boystoilet',
  'Primary_Only_water', 'U_Primary_Only_water', 'Sec_Only_water',])
     
Hrsecondaryboyenrol = Hrsecondaryboytotal.corrwith(Totalboy.Higher_Secondary_Boys_enrol)

Hrsecondaryboyenrol = pd.DataFrame(Hrsecondaryboyenrol, columns=['Correlation'])
Hrsecondaryboyenrol.dropna(inplace=True)
Hrsecondaryboyenrol = Hrsecondaryboyenrol[Hrsecondaryboyenrol["Correlation"]>0.5].sort_values("Correlation",ascending=False)
Hrsecondaryboyenrol[1:]

                       Correlation
HrSec_Only_water          0.985941
HrSec_Only_elect          0.857206
HrSec_Only_comps          0.759530
HrSec_Only_boystoilet     0.724850

All four features (water, electricity, computer and toilet plays a role with water and electrcity playing the most in Boys Higher Secondary Schools

### girls Enrollmemt facts via school level

In [76]:
all_cols = Totalgirl.columns.to_list()
all_cols[2:]

['Primary_Girls_enrol',
 'Upper_Primary_Girls_enrol',
 'Secondary_Girls_enrol',
 'Higher_Secondary_Girls_enrol',
 'Primary_Only_elect',
 'U_Primary_Only_elect',
 'Sec_Only_elect',
 'HrSec_Only_elect',
 'Primary_Only_comps',
 'U_Primary_Only_comps',
 'Sec_Only_comps',
 'HrSec_Only_comps',
 'Primary_Only_girlstoilet',
 'U_Primary_Only_girlstoilet',
 'Sec_Only_girlstoilet',
 'HrSec_Only_girlstoilet',
 'Primary_Only_water',
 'U_Primary_Only_water',
 'Sec_Only_water',
 'HrSec_Only_water']

In [81]:
#Primary School Enrollment is affected by

Primarygirltotal = Totalgirl.drop(columns=['Upper_Primary_Girls_enrol', 'Secondary_Girls_enrol', 'Higher_Secondary_Girls_enrol',
  'U_Primary_Only_elect', 'Sec_Only_elect', 'HrSec_Only_elect',
  'U_Primary_Only_comps', 'Sec_Only_comps', 'HrSec_Only_comps',
 'U_Primary_Only_girlstoilet', 'Sec_Only_girlstoilet', 'HrSec_Only_girlstoilet',
  'U_Primary_Only_water', 'Sec_Only_water', 'HrSec_Only_water'])

primarygirlenrol = Primarygirltotal.corrwith(Totalgirl.Primary_Girls_enrol)

primarygirlenrol = pd.DataFrame(primarygirlenrol, columns=['Correlation'])
primarygirlenrol.dropna(inplace=True)
primarygirlenrol = primarygirlenrol[primarygirlenrol["Correlation"]>0.5].sort_values("Correlation",ascending=False)
primarygirlenrol[1:]

Empty DataFrame
Columns: [Correlation]
Index: []

None of our facilites impacts enrollment in Girls primary school

In [83]:
#Upper Primary School Dropout is affected by 

Uprimarygirltotal = Totalgirl.drop(columns=['Primary_Girls_enrol', 'Secondary_Girls_enrol', 'Higher_Secondary_Girls_enrol',
 'Primary_Only_elect','Sec_Only_elect', 'HrSec_Only_elect',
 'Primary_Only_comps', 'Sec_Only_comps', 'HrSec_Only_comps',
 'Primary_Only_girlstoilet', 'Sec_Only_girlstoilet', 'HrSec_Only_girlstoilet',
 'Primary_Only_water', 'Sec_Only_water', 'HrSec_Only_water'])


uprimarygirlenrol = Uprimarygirltotal.corrwith(Totalgirl.Upper_Primary_Girls_enrol)

uprimarygirlenrol = pd.DataFrame(uprimarygirlenrol, columns=['Correlation'])
uprimarygirlenrol.dropna(inplace=True)
uprimarygirlenrol = uprimarygirlenrol[uprimarygirlenrol["Correlation"]> 0.5].sort_values("Correlation",ascending=False)
uprimarygirlenrol[1:]

                      Correlation
U_Primary_Only_comps     0.746367
U_Primary_Only_elect     0.626693
U_Primary_Only_water     0.551712

Increase in computer faclites, electricity and water would have a positive impact on enrollment in Girls Upper primary

In [85]:
#Secondary School Dropout is affected by 

Secondarygirltotal = Totalgirl.drop(columns=[ 'Primary_Girls_enrol','Upper_Primary_Girls_enrol','Higher_Secondary_Girls_enrol',
 'Primary_Only_elect', 'U_Primary_Only_elect', 'HrSec_Only_elect',
 'Primary_Only_comps', 'U_Primary_Only_comps', 'HrSec_Only_comps',
 'Primary_Only_girlstoilet', 'U_Primary_Only_girlstoilet','HrSec_Only_girlstoilet',
 'Primary_Only_water', 'U_Primary_Only_water', 'HrSec_Only_water'])


Secondarygirlenrol = Secondarygirltotal.corrwith(Totalgirl.Secondary_Girls_enrol)

Secondarygirlenrol = pd.DataFrame(Secondaryboyenrol, columns=['Correlation'])
Secondarygirlenrol.dropna(inplace=True)
Secondarygirlenrol = Secondarygirlenrol[Secondarygirlenrol["Correlation"]>0.5].sort_values("Correlation",ascending=False)
Secondarygirlenrol[1:]

                Correlation
Sec_Only_comps      0.79195

Computer facilites plays a role in the enrollment of the Girls secondary school

In [88]:
# Higher-Secondary School Dropout is affected by 

Hrsecondarygirltotal = Totalgirl.drop(columns=['Primary_Girls_enrol','Upper_Primary_Girls_enrol', 'Secondary_Girls_enrol',
 'Primary_Only_elect','U_Primary_Only_elect', 'Sec_Only_elect',
 'Primary_Only_comps', 'U_Primary_Only_comps', 'Sec_Only_comps',
 'Primary_Only_girlstoilet', 'U_Primary_Only_girlstoilet', 'Sec_Only_girlstoilet',
 'Primary_Only_water','U_Primary_Only_water', 'Sec_Only_water',])
     
Hrsecondarygirlenrol = Hrsecondarygirltotal.corrwith(Totalgirl.Higher_Secondary_Girls_enrol)

Hrsecondarygirlenrol = pd.DataFrame(Hrsecondarygirlenrol, columns=['Correlation'])
Hrsecondarygirlenrol.dropna(inplace=True)
Hrsecondarygirlenrol = Hrsecondarygirlenrol[Hrsecondarygirlenrol["Correlation"]>0.5].sort_values("Correlation",ascending=False)
Hrsecondarygirlenrol[1:]

                        Correlation
HrSec_Only_water           0.958760
HrSec_Only_elect           0.789206
HrSec_Only_girlstoilet     0.679132
HrSec_Only_comps           0.675973

All four features (water, electricity, computer and toilet plays a role with water and electrcity playing the most in Boys Higher Secondary Schools

# Summary
- There is a gender difference in enrollment in relation to our other features (Computer, water, Toilet and electricity)

- None of our facilites influenced enrollment in **primary school**.

- Increase in computer faclites, electricity and water would have a positive impact on enrollment in **Girls Upper primary**

- Computer facilites plays a role in the enrollment of the **secondary school**.

- All four features influcenced enrollment especially with water and electrcity in **Higher Secondary Schools**.